<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductTableSeeder extends Seeder
{
    

    public function run(): void
    {


        DB::table('product')->truncate(); 

        DB::table('product')->insert([
            [
                'name' => 'Apple iPhone 16',
                'price' => 579.00,
                'description' => 'first description',
                'full_description' => '//Серія//
                                        "`Серія` *Iphone 16*"
                                        //Стандарт зв’язку/інтернет//
                                        "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE) # 5G*"
                                        //Дисплей//
                                        "`Діагональ екрана` *6.1*"
                                        "`Роздільна здатність дисплея` *2556x1179*"
                                        "`Тип матриці` *OLED (Super Retina XDR)*"
                                        "`Частота оновлення екрана` *60 Гц*"
                                        "`Додатково`  *Динамічний острів #  Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch  #  Контрастність 2 000 000:1 (стандартна)  #  Яскравість: 1000 ніт (стандартна), 1600 ніт (пікова з HDR), 2000 ніт (на вулиці), 1 ніт (мінімальна яскравість)*"
                                        "`Матеріал екрана` *Ceramic Shield*"

                                        //SIM-картки//
                                        "`Кількість SIM-карток` *2*"
                                        "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                        //Функції пам’яті//
                                        "`Вбудована пам’ять` *512 ГБ*"
                                        "`Максимальний обсяг карти пам’яті` *Немає*"
                                        //Операційна система//
                                        "`Операційна система` *iOS*"
                                        //Фронтальна камера//
                                        "`Фронтальна камера` *12 Мп*"
                                        "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4К # Стабілізація # Програмний спалах # Розміщення у вирізі*"
                                        "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                        "`Додатково` *Діафрагма ƒ/1.9 # Автофокус з Focus Pixels # Retina Flash # Photonic Engine # Deep Fusion # Smart HDR 5 # Портрети з фокусуванням і контролем глибини # Широке захоплення кольорів # Автоматична стабілізація зображення*"
                                        //Метод стабілізації//
                                        "`Метод стабілізації` *Цифрова*"
                                        //Процесор//
                                        "`Назва процесора` *Apple A18*"
                                        "`Кількість ядер` *2+4*"
                                        "`Серія Apple` *Apple Ax Series*"
                                        //Основна камера//
                                        "`Основна камера` *48 Мп + 12 Мп*"
                                        "`Особливості основної камери` *Автофокус # Підтримка знімання 4К # Ультраширококутний об`єктив # Стабілізація # True Tone # Photonic Engine*"
                                        "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                        //Матеріали//
                                        "`Матеріал корпуса` *Алюміній + скло*"
                                        //Роз`єми//
                                        "`Роз’єми` *USB Type-C*"
                                        //Навігація//
                                        "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                        //Розміри//
                                        "`Вага` *170 г*"
                                        "`Ширина` *71.6 мм*"
                                        "`Висота` *147.6 мм*"
                                        "`Глибина` *7.8 мм*"
                                        //Бездротові технології//
                                        "`Характеристики бездротових технологій` *Wi‑Fi 7 (802.11be) 2x2 MIMO # Bluetooth 5.3 # Ultra Wideband # Thread # NFC з резервним живленням*"
                                        //Безпека//
                                        "`Безпека` *Розблокування за обличчям*"
                                        //Пило/вологозахист//
                                        "`Ступінь захисту` *IP68*"
                                        //Датчики//
                                        "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                        //Комплект постачання//
                                        "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                        //Бездротові технології//
                                        "`Бездротові технології` *Bluetooth 5.3 # NFC # Wi-Fi # Бездротова зарядка*"
                                        //Оснащення//
                                        "`Підтримка e-SIM` *Так*"
                                        "`Стереодинаміки` *Так*"
                                        "`Швидке заряджання` *Так*"
                                        //Форм-фактор//
                                        "`Форм-фактор` *Моноблок*"
                                        //Особливості корпусу//
                                        "`Особливості корпусу` *Безрамковий дисплей # Водонепроникність*"
                                        //Колір//
                                        "`Колір` *Teal*"
                                        //Гарантія та походження//
                                        "`Країна реєстрації бренду` *США*"
                                        "`Гарантія` *12 місяців*"
                                        "`Країна-виробник товару` *Китай*"
                                        "',
                'image' => 'https://content2.rozetka.com.ua/goods/images/big/468886706.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 15',
                'price' => 500.00,
                'description' => 'second description',
                'full_description' => '//Серія//
                                        "`Серія` *Iphone 15*"
                                        //Стандарт зв’язку/інтернет//
                                        "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE) # 5G*"
                                        //Дисплей//
                                        "`Діагональ екрана` *6.1*"
                                        "`Роздільна здатність дисплея` *2556x1179*"
                                        "`Тип матриці` *OLED (Super Retina XDR)*"
                                        "`Частота оновлення екрана` *60 Гц*"
                                        "`Додатково`  *Динамічний острів #  Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch  #  Контрастність 2 000 000:1 (стандартна)  #  Яскравість: 1000 ніт (стандартна), 1600 ніт (пікова з HDR), 2000 ніт (на вулиці), 1 ніт (мінімальна яскравість)*"
                                        "`Матеріал екрана` *Ceramic Shield*"
            
                                        //SIM-картки//
                                        "`Кількість SIM-карток` *2*"
                                        "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                        //Функції пам’яті//
                                        "`Вбудована пам’ять` *256 ГБ*"
                                        "`Максимальний обсяг карти пам’яті` *Немає*"
                                        //Операційна система//
                                        "`Операційна система` *iOS*"
                                        //Фронтальна камера//
                                        "`Фронтальна камера` *12 Мп*"
                                        "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4К # Стабілізація # Програмний спалах # Розміщення у вирізі*"
                                        "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                        "`Додатково` *Діафрагма ƒ/1.9 # Автофокус з Focus Pixels # Retina Flash # Photonic Engine # Deep Fusion # Smart HDR 5 # Портрети з фокусуванням і контролем глибини # Широке захоплення кольорів # Автоматична стабілізація зображення*"
                                        //Метод стабілізації//
                                        "`Метод стабілізації` *Цифрова*"
                                        //Процесор//
                                        "`Назва процесора` *Apple A17*"
                                        "`Кількість ядер` *2+4*"
                                        "`Серія Apple` *Apple Ax Series*"
                                        //Основна камера//
                                        "`Основна камера` *48 Мп + 12 Мп*"
                                        "`Особливості основної камери` *Автофокус # Підтримка знімання 4К # Ультраширококутний об`єктив # Стабілізація # True Tone # Photonic Engine*"
                                        "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                        //Матеріали//
                                        "`Матеріал корпуса` *Алюміній + скло*"
                                        //Роз`єми//
                                        "`Роз’єми` *USB Type-C*"
                                        //Навігація//
                                        "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                        //Розміри//
                                        "`Вага` *170 г*"
                                        "`Ширина` *71.6 мм*"
                                        "`Висота` *147.6 мм*"
                                        "`Глибина` *7.8 мм*"
                                        //Бездротові технології//
                                        "`Характеристики бездротових технологій` *Wi‑Fi 7 (802.11be) 2x2 MIMO # Bluetooth 5.3 # Ultra Wideband # Thread # NFC з резервним живленням*"
                                        //Безпека//
                                        "`Безпека` *Розблокування за обличчям*"
                                        //Пило/вологозахист//
                                        "`Ступінь захисту` *IP68*"
                                        //Датчики//
                                        "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                        //Комплект постачання//
                                        "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                        //Бездротові технології//
                                        "`Бездротові технології` *Bluetooth 5.3 # NFC # Wi-Fi # Бездротова зарядка*"
                                        //Оснащення//
                                        "`Підтримка e-SIM` *Так*"
                                        "`Стереодинаміки` *Так*"
                                        "`Швидке заряджання` *Так*"
                                        //Форм-фактор//
                                        "`Форм-фактор` *Моноблок*"
                                        //Особливості корпусу//
                                        "`Особливості корпусу` *Безрамковий дисплей # Водонепроникність*"
                                        //Колір//
                                        "`Колір` *Black*"
                                        //Гарантія та походження//
                                        "`Країна реєстрації бренду` *США*"
                                        "`Гарантія` *12 місяців*"
                                        "`Країна-виробник товару` *Китай*"
                                        ',
                'image' => 'https://content1.rozetka.com.ua/goods/images/big/364623617.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 14',
                'price' => 449.00,
                'description' => 'third description',
                'full_description' => '//Серія//
                                                "`Серія` *Iphone 14*"
                                                //Стандарт зв’язку/інтернет//
                                                "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE) # 5G*"
                                                //Дисплей//
                                                "`Діагональ екрана` *6.1*"
                                                "`Роздільна здатність дисплея` *2532x1170*"
                                                "`Тип матриці` *OLED (Super Retina XDR)*"
                                                "`Частота оновлення екрана` *60 Гц*"
                                                "`Додатково`  *Динамічний острів # Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch  #  Контрастність 2 000 000:1 (стандартна)  #  Яскравість: 800 ніт (стандартна), 1200 ніт (пікова з HDR)*"
                                                "`Матеріал екрана` *Ceramic Shield*"
                                                
                                                //SIM-картки//
                                                "`Кількість SIM-карток` *2*"
                                                "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                                //Функції пам’яті//
                                                "`Вбудована пам’ять` *128 ГБ*"
                                                "`Максимальний обсяг карти пам’яті` *Немає*"
                                                //Операційна система//
                                                "`Операційна система` *iOS*"
                                                //Фронтальна камера//
                                                "`Фронтальна камера` *12 Мп*"
                                                "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація # Розміщення у вирізі*"
                                                "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                                "`Додатково` *Діафрагма ƒ/1.9 # Автофокус з Focus Pixels # Retina Flash # Photonic Engine # Deep Fusion # Smart HDR 4*"
                                                //Метод стабілізації//
                                                "`Метод стабілізації` *Цифрова*"
                                                //Процесор//
                                                "`Назва процесора` *Apple A15 Bionic*"
                                                "`Кількість ядер` *6*"
                                                "`Серія Apple` *Apple Ax Series*"
                                                //Основна камера//
                                                "`Основна камера` *12 Мп + 12 Мп*"
                                                "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                                "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                                //Матеріали//
                                                "`Матеріал корпуса` *Алюміній + скло*"
                                                //Роз`єми//
                                                "`Роз’єми` *Lightning*"
                                                //Навігація//
                                                "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                                //Розміри//
                                                "`Вага` *174 г*"
                                                "`Ширина` *71.5 мм*"
                                                "`Висота` *146.7 мм*"
                                                "`Глибина` *7.8 мм*"
                                                //Бездротові технології//
                                                "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                                //Безпека//
                                                "`Безпека` *Розблокування за обличчям*"
                                                //Пило/вологозахист//
                                                "`Ступінь захисту` *IP68*"
                                                //Датчики//
                                                "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                                //Комплект постачання//
                                                "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                                //Бездротові технології//
                                                "`Бездротові технології` *Bluetooth 5.0 # NFC # Wi-Fi # Бездротова зарядка*"
                                                //Оснащення//
                                                "`Підтримка e-SIM` *Так*"
                                                "`Стереодинаміки` *Так*"
                                                "`Швидке заряджання` *Так*"
                                                //Форм-фактор//
                                                "`Форм-фактор` *Моноблок*"
                                                //Особливості корпусу//
                                                "`Особливості корпусу` *Безрамковий дисплей # Водонепроникність*"
                                                //Колір//
                                                "`Колір` *Red*"
                                                //Гарантія та походження//
                                                "`Країна реєстрації бренду` *США*"
                                                "`Гарантія` *12 місяців*"
                                                "`Країна-виробник товару` *Китай*"
                                                ',
                'image' => 'https://content1.rozetka.com.ua/goods/images/big/284913534.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 13',
                'price' => 399.00,
                'description' => 'fourth description',
                'full_description' => '//Серія//
                                                "`Серія` *Iphone 13*"
                                                //Стандарт зв’язку/інтернет//
                                                "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE) # 5G*"
                                                //Дисплей//
                                                "`Діагональ екрана` *6.1*"
                                                "`Роздільна здатність дисплея` *2532x1170*"
                                                "`Тип матриці` *OLED (Super Retina XDR)*"
                                                "`Частота оновлення екрана` *60 Гц*"
                                                "`Додатково` *Динамічний острів # Підтримка HDR  # Розширена колірна гама (P3)  # Haptic Touch*"
                                                "`Матеріал екрана` *Ceramic Shield*"
                                                
                                                //SIM-картки//
                                                "`Кількість SIM-карток` *2*"
                                                "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                                //Функції пам’яті//
                                                "`Вбудована пам’ять` *128 ГБ*"
                                                "`Максимальний обсяг карти пам’яті` *Немає*"
                                                //Операційна система//
                                                "`Операційна система` *iOS*"
                                                //Фронтальна камера//
                                                "`Фронтальна камера` *12 Мп*"
                                                "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                                "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                                "`Додатково` *Діафрагма ƒ/2.2 # Retina Flash # Photonic Engine # Deep Fusion*"
                                                //Метод стабілізації//
                                                "`Метод стабілізації` *Цифрова*"
                                                //Процесор//
                                                "`Назва процесора` *Apple A15 Bionic*"
                                                "`Кількість ядер` *6*"
                                                "`Серія Apple` *Apple Ax Series*"
                                                //Основна камера//
                                                "`Основна камера` *12 Мп + 12 Мп*"
                                                "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація*"
                                                "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                                //Матеріали//
                                                "`Матеріал корпуса` *Алюміній + скло*"
                                                //Роз`єми//
                                                "`Роз’єми` *Lightning*"
                                                //Навігація//
                                                "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                                //Розміри//
                                                "`Вага` *174 г*"
                                                "`Ширина` *71.5 мм*"
                                                "`Висота` *146.7 мм*"
                                                "`Глибина` *7.65 мм*"
                                                //Бездротові технології//
                                                "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                                //Безпека//
                                                "`Безпека` *Розблокування за обличчям*"
                                                //Пило/вологозахист//
                                                "`Ступінь захисту` *IP68*"
                                                //Датчики//
                                                "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                                //Комплект постачання//
                                                "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                                //Бездротові технології//
                                                "`Бездротові технології` *Bluetooth 5.0 # NFC # Wi-Fi # Бездротова зарядка*"
                                                //Оснащення//
                                                "`Підтримка e-SIM` *Так*"
                                                "`Стереодинаміки` *Так*"
                                                "`Швидке заряджання` *Так*"
                                                //Форм-фактор//
                                                "`Форм-фактор` *Моноблок*"
                                                //Особливості корпусу//
                                                "`Особливості корпусу` *Безрамковий дисплей # Водонепроникність*"
                                                //Колір//
                                                "`Колір` *Pink*"
                                                //Гарантія та походження//
                                                "`Країна реєстрації бренду` *США*"
                                                "`Гарантія` *12 місяців*"
                                                "`Країна-виробник товару` *Китай*"
                                                ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/221214143.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 12',
                'price' => 229.00,
                'description' => 'fifth description',
                'full_description' =>   '//Серія//
                                            "`Серія` *iPhone 12*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE) # 5G*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *2532x1170*"
                                            "`Тип матриці` *OLED (Super Retina XDR)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково` *Динамічний острів # Підтримка HDR # Розширена колірна гама (P3) # Haptic Touch # Контрастність 2 000 000:1 (стандартна) # Яскравість: 625 ніт (стандартна), 1200 ніт (пікова з HDR), 1200 ніт (на вулиці), 1 ніт (мінімальна яскравість)*"
                                            "`Матеріал екрана` *Ceramic Shield*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 14*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація # Програмний спалах # Розміщення у вирізі*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            "`Додатково` *Діафрагма ƒ/2.2 # Smart HDR 3 # Deep Fusion # Night Mode # Портрети з фокусуванням*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A14 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone # Smart HDR 3*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *164 г*"
                                            "`Ширина` *71.5 мм*"
                                            "`Висота` *146.7 мм*"
                                            "`Глибина` *7.4 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Бездротові технології//
                                            "`Бездротові технології` *Bluetooth 5.0 # NFC # Wi-Fi # Бездротова зарядка*"
                                            //Оснащення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            //Форм-фактор//
                                            "`Форм-фактор` *Моноблок*"
                                            "`Особливості корпусу` *Безрамковий дисплей # Водонепроникність*"
                                            "`Колір` *Чорний, білий, синій, зелений, червоний*"
                                            
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content1.rozetka.com.ua/goods/images/big/175435404.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 11',
                'price' => 199.00,
                'description' => 'sixth description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Apple iPhone 10',
                'price' => 99.00,
                'description' => 'seventh description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/37399220.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Google Pixel 8',
                'price' => 429.00,
                'description' => 'eight description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content1.rozetka.com.ua/goods/images/big/446289086.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Asus Vivobook Pro 15 Oled',
                'price' => 1220.00,
                'description' => 'nineth description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content1.rozetka.com.ua/goods/images/big/455804790.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
            [
                'name' => 'Asus Vivobook 16',
                'price' => 820.00,
                'description' => 'nineth description',
                'full_description' =>   '//Серія//
                                            "`Серія` *Iphone 11*"
                                            //Стандарт зв’язку/інтернет//
                                            "`Стандарт зв’язку` *2G (GPRS/EDGE) # 3G (WCDMA/UMTS/HSPA) # 4G (LTE)*"
                                            //Дисплей//
                                            "`Діагональ екрана` *6.1*"
                                            "`Роздільна здатність дисплея` *1792x828*"
                                            "`Тип матриці` *IPS LCD (Liquid Retina HD)*"
                                            "`Частота оновлення екрана` *60 Гц*"
                                            "`Додатково`  *Підтримка HDR  #  Розширена колірна гама (P3)  #  Haptic Touch*"
                                            "`Матеріал екрана` *Ion-strengthened glass*"
                                            
                                            //SIM-картки//
                                            "`Кількість SIM-карток` *2*"
                                            "`Формат SIM-картки` *Nano-SIM # e-SIM*"
                                            //Функції пам’яті//
                                            "`Вбудована пам’ять` *64 ГБ / 128 ГБ / 256 ГБ*"
                                            "`Максимальний обсяг карти пам’яті` *Немає*"
                                            //Операційна система//
                                            "`Операційна система` *iOS 13*"
                                            //Фронтальна камера//
                                            "`Фронтальна камера` *12 Мп*"
                                            "`Особливості фронтальної камери` *Автофокус # Одинарна # Підтримка знімання 4K # Стабілізація*"
                                            "`Запис відео фронтальної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Процесор//
                                            "`Назва процесора` *Apple A13 Bionic*"
                                            "`Кількість ядер` *6*"
                                            "`Серія Apple` *Apple A Series*"
                                            //Основна камера//
                                            "`Основна камера` *12 Мп + 12 Мп (ширококутна + ультраширококутна)*"
                                            "`Особливості основної камери` *Автофокус # Підтримка знімання 4K # Ультраширококутний об`єктив # Стабілізація # True Tone*"
                                            "`Запис відео основної камери` *4K/3840x2160/стереозвук*"
                                            
                                            //Матеріали//
                                            "`Матеріал корпуса` *Алюміній + скло*"
                                            //Роз`єми//
                                            "`Роз’єми` *Lightning*"
                                            //Навігація//
                                            "`Навігація` *BDS # GPS # Galileo # ГЛОНАСС # Цифровий компас*"
                                            //Розміри//
                                            "`Вага` *194 г*"
                                            "`Ширина` *75.7 мм*"
                                            "`Висота` *150.9 мм*"
                                            "`Глибина` *8.3 мм*"
                                            
                                            //Бездротові технології//
                                            "`Характеристики бездротових технологій` *Wi‑Fi 6 (802.11ax) 2x2 MIMO # Bluetooth 5.0 # Ultra Wideband # NFC з резервним живленням*"
                                            //Безпека//
                                            "`Безпека` *Розблокування за обличчям*"
                                            //Пило/вологозахист//
                                            "`Ступінь захисту` *IP68*"
                                            //Датчики//
                                            "`Датчики` *Акселерометр # Барометр # Гіроскоп # Датчик наближення # Датчик освітлення*"
                                            //Комплект постачання//
                                            "`Комплект постачання` *Документація # Кабель синхронізації # Телефон*"
                                            //Безпроводова зарядка//
                                            "`Безпровідна зарядка` *Так*"
                                            //Програмне забезпечення//
                                            "`Підтримка e-SIM` *Так*"
                                            "`Швидке заряджання` *Так*"
                                            "`Стереодинаміки` *Так*"
                                            //Гарантія та походження//
                                            "`Країна реєстрації бренду` *США*"
                                            "`Гарантія` *12 місяців*"
                                            "`Країна-виробник товару` *Китай*"
                                            ',
                'image' => 'https://content.rozetka.com.ua/goods/images/big/334397470.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ], 
        ]);

    }
}
